/** @file


;******************************************************************************
;* Copyright (c) 2022, Insyde Software Corp. All Rights Reserved.
;*
;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
;* transmit, broadcast, present, recite, release, license or otherwise exploit
;* any part of this publication in any form, by any means, without the prior
;* written permission of Insyde Software Corp.
;*
;******************************************************************************
*/

/=#

#include "Standard.uni"

//
// Basic (Trademark, Product Name, BIOS version, BIOS release date, UUID...etc.)
//
#string STR_TRADEMARK                 #language en-US  "(c) Copyright 2022 Insyde Software\r\n"
#string STR_SYSTEM_UUID_TEXT_FORMAT   #language en-US  "UUID: %g\r\n"
#string STR_BIOS_VERSION_TEXT_FORMAT  #language en-US  "BIOS Version: %s (%s)\r\n"

#string STR_UEFI_OS_FAST_BOOT_ACTIVE  #language en-US  "UEFI OS Fast Boot active. Skip probing storage devices and USB HIDs.\r\n"

#string STR_SMART_STATUS_NA           #language en-US  "N/A"
#string STR_SMART_STATUS_BAD          #language en-US  "BAD"
#string STR_SMART_STATUS_OK           #language en-US  "OK"
#string STR_SMART_STATUS              #language en-US  "SMART: "
#string STR_SMART_DISABLED            #language en-US  "SMART Disabled"
#string STR_SMART_NO_INFORMATION      #language en-US  "No SMART Info"

#include "CpuInfo.uni"
#include "MemoryInfo.uni"
#include "BmcInfo.uni"
#include "InputDeviceInfo.uni"
#include "SataDriveInfo.uni"
#include "NvmeInfo.uni"
